#Очень простая задача (Задание №1, Урок 3)
#Задача:У вас есть список numbers. Напишите программу, которая заполняет список 
#числами от 0 до 100 и выводит его на экран.


#Ответ: 

numbers = list(range(101))
print(numbers)