#Орёл или решка? (Задание №3, Урок 4)
#Задача: Дан список из N чисел. Напишите программу, которая сортирует элементы
#списка по возрастанию и выводит их на экран. Дополнительный список нельзя использовать.


#Ответ: 

spisok = [1, 4, -3, 0, 10]
print(sorted(spisok)) #сортируем список