#Животные (Задание №2, Урок 1)
#Задача: Создайте две переменные с именами «Первое животное» и «Второе животное» на английском языке. Запишите в первую переменную слово «Заяц», а
#во вторую — «Черепаха». Используя эти переменные, выведите на экран текст «Заяц спит, Черепаха идёт» в одну строку.

#Ответ: 

one_animals = "Заяц" #создаём две переменные с названиями животных
two_animals = "Черепаха"
print(one_animals , "спит" , two_animals , "идёт") #выводим переменные с текстом, выделя запятыми 
#или иначе программа не будет работать (есть и другие способы)