#Пропавшая переменная (Задание №1, Урок 1)
#Задача: найдите в программе необъявленную переменную и объявите её, присвоив ей значение ‘Кот’.
#Программа: 
# // client = 'Петя'
# // print(client)
# // print(' и ')
# // print(pet)

#Ответ: 

client = "Петя" 
pet = "Кот" #создаём ещё одну переменную, тем делая её обявлённой
print(client) 
print(' и ') 
print(pet)

