#Сумма (Задание №2, Урок 2)
#Задача: дан список из 5 элементов: [1, 2, 3, 4, 5]. Найдите сумму этого списка. Решите задачу двумя способами.

#Ответ: 

x = sum([1, 2, 3, 4, 5]) #с помощью sum суммируем список
print(x)