#Срезы (Задание №1, Урок 2)
#Задача: Дан список из 3 элементов: [‘первый элемент’, ‘второй элемент’, ‘третий элемент’]. Выведите список в обратном порядке 
# (реализовать решение необходимо в одну строчку, без учёта первичной инициализации списка в коде).

#Ответ: 

a = [1,2,5] #в переменную добавляем список 
print(a[::-1]) #выводим список в обратом порядке (-1 переворачивает список, т.е счёт начинается наооборот)